
<!-- terraform-plan-dev -->
### 🌍 Terraform Plan – **DEV**

<details>
<summary>Click to expand</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.aws_eks_cluster.eks: Reading...
data.aws_eks_cluster_auth.eks: Reading...
module.vpc.aws_eip.nat: Refreshing state... [id=eipalloc-0cce5e41bdbc87a3d]
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-03941e8b2d25f3f29]
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=Shared-cluster]
data.aws_eks_cluster.eks: Read complete after 0s [id=Shared-cluster]
module.eks-access.aws_eks_access_policy_association.policy["arn:aws:iam::358871393576:role/github-actions-terraform-role"]: Refreshing state... [id=Shared-cluster#arn:aws:iam::358871393576:role/github-actions-terraform-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks-access.aws_eks_access_entry.access["arn:aws:iam::358871393576:role/github-actions-terraform-role"]: Refreshing state... [id=Shared-cluster:arn:aws:iam::358871393576:role/github-actions-terraform-role]
module.argocd.kubernetes_namespace.argocd: Refreshing state... [id=argocd]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0ed3230ce3c9f338b]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c8a34911a54a6c74]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0475d98ab56c5a428]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-03474a57401dd96d8]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-04117bbb5d82ac44e]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0c2714b25b607fdd2]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03a90a5bde313b897]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-035f5c6cd4b42d4a7]
module.vpc.aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-069faa912545e93bf]
module.vpc.aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-077a243c638d09a2f]
module.vpc.aws_route_table_association.public["2"]: Refreshing state... [id=rtbassoc-0b91f10f2529a4055]
module.vpc.aws_nat_gateway.this: Refreshing state... [id=nat-03fcc9964b674b655]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-004add3b718ded441]
module.vpc.aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-081f73e9080efc510]
module.vpc.aws_route_table_association.private["2"]: Refreshing state... [id=rtbassoc-02926d9def3fda9b4]
module.vpc.aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0890352860f44c6a2]
module.eks.aws_iam_role.node_role: Refreshing state... [id=dev-2-eks-node-role]
module.eks.aws_iam_role.eks_cluster_role: Refreshing state... [id=dev-2-eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.cni_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317057100000002]
module.eks.aws_iam_role_policy_attachment.worker_node_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317116500000003]
module.eks.aws_iam_role_policy_attachment.ecr_policy: Refreshing state... [id=dev-2-eks-node-role-20260316022317049400000001]
module.eks.aws_iam_role_policy_attachment.cluster_policy_attachment: Refreshing state... [id=dev-2-eks-cluster-role-20260316022317124300000004]
module.eks.aws_eks_cluster.this: Refreshing state... [id=Shared-cluster]
module.eks.aws_security_group_rule.alloow_private_endpoint_access[0]: Refreshing state... [id=sgrule-4103570733]
module.addons.aws_eks_addon.coredns: Refreshing state... [id=Shared-cluster:coredns]
module.eks.aws_eks_node_group.this: Refreshing state... [id=Shared-cluster:dev-2-eks-node-group]
module.addons.aws_eks_addon.vpc_cni: Refreshing state... [id=Shared-cluster:vpc-cni]
module.eks.aws_iam_openid_connect_provider.this: Refreshing state... [id=arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D]
module.addons.aws_eks_addon.kube_proxy: Refreshing state... [id=Shared-cluster:kube-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.argocd.kubernetes_namespace.argocd has been deleted
  - resource "kubernetes_namespace" "argocd" {
        id                               = "argocd"
        # (1 unchanged attribute hidden)

      - metadata {
          - name             = "argocd" -> null
            # (5 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.helm_release.argocd will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                server:
                  service:
                    type: LoadBalancer
                
                configs:
                  params:
                    server.insecure: true
            EOT,
        ]
      + verify                     = false
      + version                    = "5.51.6"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.argocd.kubectl_manifest.argocd_bootstrap will be created
  + resource "kubectl_manifest" "argocd_bootstrap" {
      + api_version             = "argoproj.io/v1alpha1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Application"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "app-of-apps"
      + namespace               = "argocd"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: argoproj.io/v1alpha1
            kind: Application
            metadata:
              name: app-of-apps
              namespace: argocd
            spec:
              destination:
                namespace: argocd
                server: https://kubernetes.default.svc
              project: default
              source:
                path: argocd-applications
                repoURL: https://github.com/ashubambal/student-management-k8s.git
                targetRevision: main
              syncPolicy:
                automated:
                  prune: true
                  selfHeal: true
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.argocd.kubernetes_namespace.argocd will be created
  + resource "kubernetes_namespace" "argocd" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.eks.data.tls_certificate.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "eks" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D"
    }

  # module.eks.aws_iam_openid_connect_provider.this will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::358871393576:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/71A63A6AC8B180890192071909BC093D"
        tags            = {}
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-004add3b718ded441"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-03fcc9964b674b655"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-03fcc9964b674b655"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "dev-2-private-rt"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
